package Led6;

import java.util.StringTokenizer;

public class Example_StringToken {
    public static void main(String[] args) {
        StringBuffer str = new StringBuffer("ดวงอาทิตย์เป็นดาวฤกษ์ที่อยู่ตรงใจกลางของระบบสุริยะ ดวงอาทิตย์ให้แสงสว่าง ความร้อน และพลังงานรูปแบบอื่นแก่โลก ดวงอาทิตย์อยู่ในสถานะที่เรียกว่า พลาสมา พลาสมาคือ " +
                "สถานะที่ 4 ของสสาร คือ แก๊สที่อิเล็กตรอนไม่ได้ยึดติดกับนิวเคลียส ดังนั้น พลาสมาจึงมีความเป็นกลางทางประจุไฟฟ้า รอบ ๆ ดวงอาอาทิตย์ประกอบด้วยดาวเคราะห์ต่าง ๆ กับดาวบริวารของมัน ดาวเคราะห์น้อยอีกนับแสน และดาวหางอีกเป็นล้านล้าน ทั้งหมดนี้รวมเรียกว่า ระบบสุริยะ\n" +
                "\n" +
                "ดวงอาทิตย์อยู่ห่างจากโลกประมาณ 150 ล้านกิโลเมตร หรือ 1 AU (Astronomical Unit) มีมวลประมาณ 1.9x1030 กิโลกรัม มีรัศมี (วัดบริเวณเส้นศูนย์สูตร) ประมาณ 695,500 กิโลเมตร" +
                " ดวงอาทิตย์ประกอบด้วยไฮโดรเจน 75% ต่อมวล ฮีเลียม 25% ต่อมวล และธาตุหนักอื่น ๆ อีกน้อยกว่า 1% ต่อมวล\n" +
                "\n" +
                "ผิวของดวงอาทิตย์ที่เรามองเห็นได้มีอุณหภูมิประมาณ 5,500 องศาเซลเซียส นักดาราศาสตร์วัดอุณหภูมิผิวดาวฤกษ์ในหน่วยของเคลวิน ซึ่ง 1 เคลวิน เท่ากับ 1 องศาเซลเซียส เท่ากับ 1.8 องศาฟาเรนไฮต์ " +
                "แต่จุดเริ่มต้นของเคลวินและองศาเซลเซียสแตกต่างกัน โดยเคลวินเริ่มที่ 0 เคลวิน แต่องศาเซลเซียสเริ่มที่ -273.15 องศาเซลเซียส (เท่ากับ -459.67 องศาฟาเรนไฮต์)" +
                " ดังนั้น อุณหภูมิที่ผิวดวงอาทิตย์จะมีค่าประมาณ 5,800 เคลวิน และอุณหภูมิที่แกนกลางของดวงอาทิตย์สูงถึงประมาณ 15 ล้านเคลวิน\n" +
                "\n" +
                "พลังงานของดวงอาทิตย์มาจากปฏิกิริยานิวเคลียร์ฟิวชัน ซึ่งเกิดที่แกนกลางของดวงอาทิตย์ ปฏิกิริยานิวเคลียร์ฟิวชันคือการรวมกันของอะตอมของธาตุเบาได้อะตอมใหม่ที่มีมวลน้อยกว่ามวลรวมของอะตอมเริ่มต้น และมวลที่หายไปนั้นถูกเปลี่ยนเป็นพลังงาน\n" +
                "\n" +
                "ดวงอาทิตย์มีความเป็นแม่เหล็ก นักวิทยาศาสตร์อธิบายความเป็นแม่เหล็กของสารในรูปแบบของสนามแม่เหล็ก ซึ่งบริเวณที่สนามแม่เหล็กมีผลจะรวมถึงอวกาศที่อยู่รอบ ๆ วัตถุแม่เหล็กนั้นด้วย สนามแม่เหล็กของดวงอาทิตย์จะเข้มมากที่บริเวณเล็ก ๆ บนผิวที่เราเรียบกว่าจุดมืด (sunspots) บนดวงอาทิตย์" +
                " บางครั้งจะมีการลุกจ้า (flares) และการปลดปล่อยก้อนมวลจากชั้นโคโรนา (coronal mass ejection) จากจุดมืดนี้ด้วย\n" +
                "\n" +
                "การลุกจ้า (flares) เป็นเหตุการณ์ที่รุนแรงมากเหตุการณ์หนึ่งในระบบสุริยะ และการปลดปล่อยก้อนมวลจากชั้นโคโรนา (coronal mass ejection) ซึ่งมีความรุนแรงมากกว่าการลุกจ้า การปลดปล่อยก้อนมวลครั้งหนึ่งอาจปล่อยมวลสารออกมามากถึง 20,000 ล้านตันสู่อวกาศ\n" +
                "\n" +
                "ดวงอาทิตย์เกิดมาเมื่อประมาณ 4,600 ล้านปีที่แล้ว และยังมีเชื้อเพลิงมากเพียงพอที่จะอยู่ต่อไปอีก 5,000 ล้านปี" +
                " หลังจากนั้นมันจะกลายเป็นดาวยักษ์แดง (red giant) และในที่สุดเมื่อชั้นบรรยากาศของมันหมดไป แกนกลางก็จะยุบตัวกลายเป็นดาวแคระขาว (white dwarf)");
        StringTokenizer strToken = new StringTokenizer(str.toString());
        int countWord = strToken.countTokens();
        System.out.println("Word count: "+countWord);
        while (strToken.hasMoreTokens()){
            System.out.println(strToken.nextToken());
        }
    }
}
